schreibfaul1/ESP32-audioI2S/src/Audio.h
        if (*start == 0) {  // all characters were spaces
            str[0] = '\0';  // return a empty string
            return;
        }

        end = start + strlen(start) - 1;  // find the end of the string

        while (end > start && isspace((unsigned char)*end)) end--;
        end[1] = '\0';  // Null-terminate the string after the last non-space character

        // Move the trimmed string to the beginning of the memory area
        memmove(str, start, strlen(start) + 1);  // +1 for '\0'
    }

    bool startsWith (const char* base, const char* str) {
    //fb
        char c;
        while ( (c = *str++) != '\0' )
          if (c != *base++) return false;
        return true;
    }

    bool endsWith(const char *base, const char *searchString) {
        int32_t slen = strlen(searchString);
        if(slen == 0) return false;
        const char *p = base + strlen(base);
    //  while(p > base && isspace(*p)) p--;  // rtrim
        p -= slen;
        if(p < base) return false;
        return (strncmp(p, searchString, slen) == 0);
    }

    int indexOf (const char* base, const char* str, int startIndex = 0) {
    //fb
        const char *p = base;
        for (; startIndex > 0; startIndex--)
            if (*p++ == '\0') return -1;
        char* pos = strstr(p, str);
        if (pos == nullptr) return -1;
        return pos - base;
    }

    int indexOf (const char* base, char ch, int startIndex = 0) {
    //fb
        const char *p = base;
        for (; startIndex > 0; startIndex--)
            if (*p++ == '\0') return -1;
        char *pos = strchr(p, ch);
        if (pos == nullptr) return -1;
        return pos - base;
    }

    int lastIndexOf(const char* haystack, const char* needle) {
    //fb
        int nlen = strlen(needle);
        if (nlen == 0) return -1;
        const char *p = haystack - nlen + strlen(haystack);
        while (p >= haystack) {
          int i = 0;
          while (needle[i] == p[i])
            if (++i == nlen) return p - haystack;
          p--;
        }
        return -1;
    }

    int lastIndexOf(const char* haystack, const char needle) {
    //fb
        const char *p = strrchr(haystack, needle);
        return (p ? p - haystack : -1);
    }

    int specialIndexOf (uint8_t* base, const char* str, int baselen, bool exact = false){
        int result = 0;  // seek for str in buffer or in header up to baselen, not nullterninated
        if (strlen(str) > baselen) return -1; // if exact == true seekstr in buffer must have "\0" at the end
        for (int i = 0; i < baselen - strlen(str); i++){
            result = i;
            for (int j = 0; j < strlen(str) + exact; j++){
                if (*(base + i + j) != *(str + j)){
                    result = -1;
                    break;
                }
            }
            if (result >= 0) break;
        }
        return result;
    }

    int32_t min3(int32_t a, int32_t b, int32_t c){
        uint32_t min_val = a;
        if (b < min_val) min_val = b;
        if (c < min_val) min_val = c;
        return min_val;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    // some other functions
    uint64_t bigEndian(uint8_t* base, uint8_t numBytes, uint8_t shiftLeft = 8) {
        uint64_t result = 0;  // Use uint64_t for greater caching
        if(numBytes < 1 || numBytes > 8) return 0;
        for (int i = 0; i < numBytes; i++) {
            result |= (uint64_t)(*(base + i)) << ((numBytes - i - 1) * shiftLeft); //Make sure the calculation is done correctly
        }
        if(result > SIZE_MAX) {
            log_e("range overflow");
            return 0;
        }
        return result;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    bool b64encode(const char* source, uint16_t sourceLength, char* dest){
        size_t size = base64_encode_expected_len(sourceLength) + 1;
        char * buffer = (char *) malloc(size);
        if(buffer) {
            base64_encodestate _state;
            base64_init_encodestate(&_state);
            int len = base64_encode_block(&source[0], sourceLength, &buffer[0], &_state);
            base64_encode_blockend((buffer + len), &_state);
            memcpy(dest, buffer, strlen(buffer));
            dest[strlen(buffer)] = '\0';
            free(buffer);
            return true;
        }
        return false;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    void vector_clear_and_shrink(std::vector<ps_ptr<char>>& vec){
        vec.clear();            // unique_ptr takes care of free()
        vec.shrink_to_fit();    // put back memory
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    uint32_t simpleHash(const char* str){
        if(str == NULL) return 0;
        uint32_t hash = 0;
        for(int i=0; i<strlen(str); i++){
		    if(str[i] < 32) continue; // ignore control sign
		    hash += (str[i] - 31) * i * 32;
        }
        return hash;
	  }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    // Request memory for an array of T
    template <typename T>
    std::unique_ptr<T[], PsramDeleter> audio_malloc(std::size_t count) {
        T* raw = static_cast<T*>(ps_malloc(sizeof(T) * count));
        if (!raw) {
            log_e("audio_malloc_array: OOM, no space for %zu bytes", sizeof(T) * count);
        }
        return std::unique_ptr<T[], PsramDeleter>(raw);
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    // Request memory for an array of T
    template <typename T>
    std::unique_ptr<T[], PsramDeleter> audio_calloc(std::size_t count) {
        T* raw = static_cast<T*>(ps_calloc(sizeof(T) * count, sizeof(char)));
        if (!raw) {
            log_e("audio_malloc_array: OOM, no space for %zu bytes", sizeof(T) * count);
        }
        return std::unique_ptr<T[], PsramDeleter>(raw);
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    // Copies raw data into a Unique_PTR goal (e.g. like memcpy)
    template <typename T>
    void audio_memcpy(std::unique_ptr<T[]>& dest, const T* src, std::size_t count) {
        static_assert(std::is_trivially_copyable<T>::value, "T must be trivially copyable");
        if (dest && src && count > 0) {
            memcpy(dest.get(), src, count * sizeof(T));
        }
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    std::unique_ptr<char[], PsramDeleter> audio_strdup(const char* str) {
        if (!str) {
            log_e("audio_strdup: input str is NULL");
            return nullptr;
        }

        size_t len = strlen(str);
        auto ps_str = audio_malloc<char>(len + 1);

        if (!ps_str) {
            log_e("audio_strdup: OOM, no space for %zu bytes", len + 1);
            return nullptr;
        }

        strcpy(ps_str.get(), str);
        return ps_str;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    std::unique_ptr<char[], PsramDeleter> audio_strndup(const char* str, size_t maxlen) {
        if (!str) {
            log_e("audio_strndup: input str is NULL");
            return nullptr;
        }

        // Effektive Länge der zu kopierenden Zeichen (nicht mehr als maxlen, nicht über das Ende hinaus)
        size_t len = strnlen(str, maxlen);

        // Speicher reservieren (+1 für Nullterminierung)
        auto ps_str = audio_malloc<char>(len + 1);

        if (!ps_str) {
            log_e("audio_strndup: OOM, no space for %zu bytes", len + 1);
            return nullptr;
        }

        // Sicher kopieren (genau len Zeichen)
        memcpy(ps_str.get(), str, len);
        ps_str[len] = '\0'; // Nullterminierung hinzufügen

        return ps_str;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    ps_ptr<char> audio_realloc(ps_ptr<char> old_ptr, size_t new_size) {
        if (new_size == 0) {
            return nullptr;
        }

